[
  {
    "id": "16",
    "name": "kamal",
    "words": "Training is excellent with lot of examples. It shows the path to the individual for effortless and memorable journey in professional and personal life.  It gives us the power to control our trigger points and remain calm at the same time continue our thought process\r\n",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "17",
    "name": "Manju Nagendra",
    "words": "Excellent English communication, excellent presentation, excellent experience, excellent relationship with training members. Very patiently explained all our queries in detail. Solutions to all our problems. Plenty of examples and interactions. Brought a change in my profession & personal life (maturity).\r\n",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "18",
    "name": "Venkatesh Patil",
    "words": "This program was really eye-opener for me as I generally react first before thinking. But after the training program I realized thinking process will really give us positive results. It also helped me to change my behavioural mind-set towards my family as well as at my workplace. ",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "20",
    "name": "Pancham Rupani (HRM)",
    "words": "Content was crisp and adequate enough for us to accept the challenges in the organization. We had got practical experience of the corporate world.\r\nWith help of class presentations we could develop our own communication skills, overall personality development, learning topics which helped in the overall development even though they were not a part of our syllabus. Visiting the corporate companies giving us live experience and briefing the practice in organization.\r\nIt was a good overall experience. Ma'am was open to our ideas and always had a positive approach to our ideas. Different way of learning, got a good individual evaluation with particular individual observation.\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "21",
    "name": "Nikita Rohra (OB )",
    "words": "To the Professor who taught more than a Subject!!\r\nWords cannot express how thankful I am that I had you as a teacher. You not only helped me through a subject but also taught me lessons that I will need to know to get through life successfully. You also helped me realize that the world is bigger than what I experience every day.\r\nIt was a pleasure meeting you and interacting with you. I consider myself blessed to have been given the opportunity to attend your lectures over the last 4 months\r\nI may not have been your brightest student, but I will never forget how I continue to grow from your lessons.\r\nI wouldn't have asked for a better mentor. Thank you for all the advice\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "22",
    "name": "Nishita Seth (HRM)",
    "words": "Clarification of all the HR related aspects. All day to day organizational events that did not fall in the syllabus were also covered that would help us in the organisation in the future. \r\nTeaching through our presentations was a very helpful method for us which made us understand the subject better and your valuable inputs were of great significance. Industry visits helped us understand how the things actually function.\r\nVery valuable feedback for our own benefits and growth. A core mentor!\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "23",
    "name": "A. K. Nigam",
    "words": "It was wonderful session, especially how to understand body language.",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "24",
    "name": "Kapil Saini",
    "words": "I want to say only one word regarding this training and for you is AWESOME",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "25",
    "name": "Anand R. Gokhale",
    "words": "Training was excellent and very informative. It will help me in form of Self-Management and Time Management.",
    "picture": "Images/test.jpg",
    "category": "Corporate"
  },
  {
    "id": "26",
    "name": "Training & Development Student (2013-15 batch)",
    "words": "Content was very relevant and practical. It was wholistic and not only about training and development. We could get information on industry practices, ways for better employability and much more.\r\nThe best part of the whole process is we are empowered to take up things. Madam acted as a wonderful facilitator so that we can transform from a caterpillar to a butterfly. The presentation & workshop were not an easy task and that is where major learning came from.\r\nThe relationship was very warm and cordial. Ma'am could be easily approached and would always come up with interesting suggestions. She would always encourage us and empower us. Our creative juices would flow that way. Ma'am can seem slightly intimidating to some but if one is genuine and sincere she is the best guide.\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "27",
    "name": "Harshad S. Ugale (HRM MMS: 2013-15 batch)",
    "words": "Strong knowledge base as it comes with a vast experience in the HR industry. This helps a lot while evaluating the topics covered in the subject. Teaching with practical examples helps to understand the concepts thoroughly.\r\nThe process of teaching is quite different from typical theory teaching. Making the concept understand through presentations and videos and then relating it to theories makes it easy to understand. The etiquette and grooming discipline insisted by her helps to maintain a corporate requirement, which will help us in near future.\r\nDisciplined relation with students - sometimes acts as a friend to them while at times acts as a strict guide, when necessary. This makes students comfortable to deal with sincerity and discipline.",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "28",
    "name": "Dipal Shah (MMS: 2013-15 batch)",
    "words": "Content:\r\n     .\tExhaustive\r\n     .\tApplication - based\r\n     .\tCovered more than just the syllabus mentioned\r\n     .\tIndustry practices were given importance\r\nProcess:\r\n     .\tPresentations and videos were helpful, covered most of the topics\r\n     .\tIndustry related examples were also given\r\n     .\tShort presentations were helpful as they covered topics apart from the syllabus\r\nRelationship:\r\n     .\tVery cordial relationship\r\n     .\tMentored us well in respect to teaching as well as disciplinary terms\r\n     .\tGuided well in respect to not just academics but also living a better and meaningful life.\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  },
  {
    "id": "29",
    "name": "MMS – Dec 2016 – Organizational Behavior  ",
    "words": "<ul><li>Excellent  in-depth subject knowledge </li>\r\n<li>One of the best professors in this business school </li>\r\n<li>Innovative teaching methods ( learning  OB from movies was fun) </li>\r\n<li>Human Centered Design Projects opened new landscapes encouraging entrepreneurship and new thought processes – creating jobs rather than just looking for jobs </li>\r\n<li>Covered extra relevant modules apart from the prescribed syllabus</li>\r\n<li>A professor who is has a high IQ as well as EQ </li>\r\n<li>A subject knowledge expert who is also a nurturing mentor </li>\r\n<li>Rapport and relationship with students is of respect </li>\r\n<li>A professor who is meticulous in planning and excellent in delivery </li>\r\n</ul>\r\n",
    "picture": "Images/test.jpg",
    "category": "Student"
  }
]
